src/Catalogs/ИсходящиеДокументы/ИсходящиеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсходящиеДокументы</name>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <basedOn>Catalog.ВнутренниеДокументы</basedOn>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Document.ВходящееПисьмо</basedOn>
  <basedOn>Document.ИсходящееПисьмо</basedOn>
  <basedOn>Catalog.Мероприятия</basedOn>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросДеятельности</name>
    <type>
      <types>CatalogRef.ВопросыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГотовКОтправке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЭкземпляров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.МестаХраненияДел</types>
      <types>CatalogRef.ТерриторииИПомещения</types>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДел</name>
    <type>
      <types>CatalogRef.НоменклатураДел</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаХранение</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подписавшего</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>DefinedType.РегистрационныйНомер</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Создал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗапретитьАвтоматическоеДобавлениеУчастниковРабочейГруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Ожидаемый срок ответа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьШаблон</name>
    <type>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПолучателиДляСписков</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаДокумента</name>
    <type>
      <types>EnumRef.ВариантыФормДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтправки</name>
      <type>
        <types>CatalogRef.СпособыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтправки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВходящийНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходящаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СубъектыПерсональныхДанных</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьЭлектронныеЦифровыеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ТипыСвязей/ТипыСвязей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыСвязей</name>
  <predefined>
    <items>
      <name>АвансовыйОтчет</name>
      <description>Авансовый отчет</description>
    </items>
    <items>
      <name>ВходитВКомплект</name>
      <description>Входит в комплект</description>
    </items>
    <items>
      <name>ДелаетНеДействующим</name>
      <description>Делает недействующим</description>
    </items>
    <items>
      <name>Исправление</name>
      <description>Исправление</description>
    </items>
    <items>
      <name>ИсправлениеК</name>
      <description>Исправление к</description>
    </items>
    <items>
      <name>Корректировка</name>
      <description>Корректировка</description>
    </items>
    <items>
      <name>КорректировкаК</name>
      <description>Корректировка к</description>
    </items>
    <items>
      <name>НаОснованииПисьма</name>
      <description>На основании письма</description>
    </items>
    <items>
      <name>НеДействуетВСоответствии</name>
      <description>Не действует в соответствии</description>
    </items>
    <items>
      <name>ОплатаПоЗаявке</name>
      <description>Оплата по заявке</description>
    </items>
    <items>
      <name>ОплаченоДокументом</name>
      <description>Оплачено документом</description>
    </items>
    <items>
      <name>ОтправилоДокумент</name>
      <description>Отправило документ</description>
    </items>
    <items>
      <name>ОтправленВОтветНа</name>
      <description>Отправлен в ответ на</description>
    </items>
    <items>
      <name>ВОтветНаПереадресованное</name>
      <description>Отправлен в ответ на переадресованное</description>
    </items>
    <items>
      <name>ОтправленВОтветНаПисьмо</name>
      <description>Отправлен в ответ на письмо</description>
    </items>
    <items>
      <name>ОтправленОтвет</name>
      <description>Отправлен ответ</description>
    </items>
    <items>
      <name>ОтветПереадресовавшему</name>
      <description>Отправлен ответ переадресовавшему</description>
    </items>
    <items>
      <name>ОтправленОтветныйДокумент</name>
      <description>Отправлен ответный документ</description>
    </items>
    <items>
      <name>ОтправленоОтветноеПисьмо</name>
      <description>Отправлено ответное письмо</description>
    </items>
    <items>
      <name>ПереадресацияДокумента</name>
      <description>Переадресация документа</description>
    </items>
    <items>
      <name>ПереадресацияДокументаПоВопросу</name>
      <description>Переадресация документа по вопросу</description>
    </items>
    <items>
      <name>ПереадресованДокументом</name>
      <description>Переадресован документом</description>
    </items>
    <items>
      <name>ПереадресованДокументомПоВопросу</name>
      <description>Переадресован документом по вопросу</description>
    </items>
    <items>
      <name>ПеренаправлениеПисьма</name>
      <description>Перенаправление письма</description>
    </items>
    <items>
      <name>ПеренаправленоПисьмом</name>
      <description>Перенаправлено письмом</description>
    </items>
    <items>
      <name>ПерепискаПоПредмету</name>
      <description>Переписка по предмету</description>
    </items>
    <items>
      <name>ПересланоПисьмом</name>
      <description>Переслано письмом</description>
    </items>
    <items>
      <name>ПересылкаПисьма</name>
      <description>Пересылка письма</description>
    </items>
    <items>
      <name>ПисьмоОтправленоВОтветНа</name>
      <description>Письмо отправлено в ответ на</description>
    </items>
    <items>
      <name>ПисьмоОснование</name>
      <description>Письмо-основание</description>
    </items>
    <items>
      <name>ПолученВОтветНа</name>
      <description>Получен в ответ на</description>
    </items>
    <items>
      <name>ПолученВОтветНаПисьмо</name>
      <description>Получен в ответ на письмо</description>
    </items>
    <items>
      <name>ПолученОтвет</name>
      <description>Получен ответ</description>
    </items>
    <items>
      <name>ПолученОтветныйДокумент</name>
      <description>Получен ответный документ</description>
    </items>
    <items>
      <name>ПолученоВОтветНаДокумент</name>
      <description>Получено в ответ на документ</description>
    </items>
    <items>
      <name>ПолученоВОтветНаПисьмо</name>
      <description>Получено в ответ на письмо</description>
    </items>
    <items>
      <name>ПолученоОтветноеПисьмо</name>
      <description>Получено ответное письмо</description>
    </items>
    <items>
      <name>ПредметОплаты</name>
      <description>Предмет оплаты</description>
    </items>
    <items>
      <name>Содержит</name>
      <description>Содержит</description>
    </items>
    <items>
      <name>ПредметПереписки</name>
      <description>Содержит переписку по</description>
    </items>
    <items>
      <name>СодержитСсылкуНаИнтегрированныйОбъект</name>
      <description>Содержит ссылку на</description>
    </items>
    <items>
      <name>СоздалоДокумент</name>
      <description>Создало документ</description>
    </items>
    <items>
      <name>ОсновноеОбращение</name>
      <description>Является дубликатом для</description>
    </items>
    <items>
      <name>Дубликат</name>
      <description>Является основным для</description>
    </items>
    <items>
      <name>ПовторноеОбращение</name>
      <description>Является первичным для</description>
    </items>
    <items>
      <name>ПервичноеОбращение</name>
      <description>Является повторным для</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/РаботаСОбращениямиВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Формирует строковое представление кода вопроса.
//
// Параметры:
//    Раздел - СправочникСсылка.Разделы - ссылка на раздел.
//    Тематика - СправочникСсылка.Тематики - ссылка на тематику.
//    Тема - СправочникСсылка.Темы - ссылка на тему.
//    Вопрос - СправочникСсылка.Вопросы - ссылка на вопрос.
//
Функция СформироватьКодВопроса(Раздел, Тематика, Тема, Вопрос) Экспорт 
	
	КодВопроса = "";
	
	Если ЗначениеЗаполнено(Раздел) Тогда 
		КодВопроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Раздел, "Код") + ".";
	Иначе 
		КодВопроса = "0000.";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Тематика) Тогда 
		КодВопроса = КодВопроса + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тематика, "Код") + ".";
	Иначе 
		КодВопроса = КодВопроса + "0000.";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Тема) Тогда 
		КодВопроса = КодВопроса + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тема, "Код") + ".";
	Иначе 
		КодВопроса = КодВопроса + "0000.";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Вопрос) Тогда 
		КодВопроса = КодВопроса + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вопрос, "Код");
	Иначе 
		КодВопроса = КодВопроса + "0000";
	КонецЕсли;
	
	Возврат КодВопроса;
	
КонецФункции

// Заполняет вопросы обращения по документу
//
Процедура ЗаполнитьВопросыДокумента(Документ, ТаблицаВопросов) Экспорт 
	
	Документ.ВопросыОбращения.Очистить();
	Для Каждого СтрокаТаблицы Из ТаблицаВопросов Цикл 
		НоваяСтрока = Документ.ВопросыОбращения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

// Формирует структуру данных сопроводительного документа.
//
// Параметры:
//    Документ - СправочникСсылка.ИсходящиеДокументы - ссылка на документ.
//
// Возвращаемое значение:
//    Результат - Структура - данные документа.
//
Функция ДанныеСопроводительногоДокумента(Документ) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсходящиеДокументы.Заголовок,
		|	ИсходящиеДокументы.ДатаРегистрации,
		|	ИсходящиеДокументы.РегистрационныйНомер,
		|	ИсходящиеДокументы.Проект,
		|	ИсходящиеДокументы.ВопросДеятельности,
		|	ИсходящиеДокументы.Получатели.(
		|		Получатель,
		|		Адресат
		|	) КАК Получатели
		|ИЗ
		|	Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
		|ГДЕ
		|	ИсходящиеДокументы.Ссылка = &Документ";
		
	Запрос.Параметры.Вставить("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Структура;
	Если Выборка.Следующий() Тогда 
		Результат.Вставить("Заголовок", Выборка.Заголовок);
		Результат.Вставить("ДатаРегистрации", Выборка.ДатаРегистрации);
		Результат.Вставить("РегистрационныйНомер", Выборка.РегистрационныйНомер);
		Результат.Вставить("Проект", Выборка.Проект);
		Результат.Вставить("ВопросДеятельности", Выборка.ВопросДеятельности);
		
		Получатели = Выборка.Получатели.Выгрузить();
		Для Каждого Получатель Из Получатели Цикл 
			Результат.Вставить("Получатель", Получатель.Получатель);
			Результат.Вставить("Адресат", Получатель.Адресат);
			Прервать;
		КонецЦикла;
	Иначе 
		Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ,
			"РегистрационныйНомер, ДатаРегистрации, Заголовок, ВопросДеятельности, Проект");
		Результат.Вставить("Получатель", Неопределено);
		Результат.Вставить("Адресат", Неопределено);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет таблицу сопроводительных документов по всем вопросам обращения.
//
// Параметры:
//    Документ - СправочникСсылка.ВходящиеДокументы - ссылка на обращение.
//    Таблица  - ТаблицаЗначений - таблица, содержащая код вопроса и ссылку на сопроводительный документ.
//
Процедура ЗаполнитьСвязанныеДокументы(Документ, Таблица) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	Таблица.Очистить();
	
	СвязанныеДокументы = СвязиДокументов.ПолучитьВсеСвязиДокумента(
		Документ, Ложь);
	Для Каждого СвязанныйДокумент Из СвязанныеДокументы Цикл 
		Если СвязанныйДокумент.ТипСвязи = Справочники.ТипыСвязей.ПереадресованДокументомПоВопросу Тогда 
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.СопроводительныйДокумент = СвязанныйДокумент.СвязанныйДокумент;
			ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.СопроводительныйДокумент,
			"РегистрационныйНомер, ДатаРегистрации, Заголовок");
			Если ЗначениеЗаполнено(ДанныеДокумента.РегистрационныйНомер) И ЗначениеЗаполнено(ДанныеДокумента.ДатаРегистрации) Тогда
				НоваяСтрока.СопроводительныйДокументСтрока = СтрШаблон(
					НСтр("ru = '№ %1 от %2'"), ДанныеДокумента.РегистрационныйНомер,
					Формат(ДанныеДокумента.ДатаРегистрации, "ДЛФ=D"));
			Иначе
				НоваяСтрока.СопроводительныйДокументСтрока = ДанныеДокумента.Заголовок;
			КонецЕсли;
			
			НоваяСтрока.ДатаРегистрации = ДанныеДокумента.ДатаРегистрации;
			НоваяСтрока.РегистрационныйНомер = ДанныеДокумента.РегистрационныйНомер;
			
		ИначеЕсли СвязанныйДокумент.ТипСвязи = Справочники.ТипыСвязей.ОтправленОтвет Тогда 
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.ОтветныйДокумент = СвязанныйДокумент.СвязанныйДокумент;
			
			ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.ОтветныйДокумент,
				"РегистрационныйНомер, ДатаРегистрации, Заголовок");
			Если ЗначениеЗаполнено(ДанныеДокумента.РегистрационныйНомер) И ЗначениеЗаполнено(ДанныеДокумента.ДатаРегистрации) Тогда
				НоваяСтрока.ОтветныйДокументСтрока = СтрШаблон(
					НСтр("ru = '№ %1 от %2'"), ДанныеДокумента.РегистрационныйНомер,
					Формат(ДанныеДокумента.ДатаРегистрации, "ДЛФ=D"));
			Иначе
				НоваяСтрока.ОтветныйДокументСтрока = ДанныеДокумента.Заголовок;
			КонецЕсли;
			
			НоваяСтрока.ОтветныйДатаРегистрации = ДанныеДокумента.ДатаРегистрации;
			НоваяСтрока.ОтветныйРегистрационныйНомер = ДанныеДокумента.РегистрационныйНомер;
		Иначе 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока.Вопрос = СвязанныйДокумент.ДополнительныйОбъектСвязи;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает список исходящих документов по вводу по строке.
//
// Параметры:
//    СтрокаПоиска - Строка - введенный текст.
//    Отправитель  - СправочникСсылка.Контрагенты - ссылка на отправителя.
//
// Возвращаемое значение:
//    ДанныеВыбора - СписокЗначений - список документов, удовлетворяющих поиску.
//
Функция НайтиИсходящиеДокументы(СтрокаПоиска, Отправитель = Неопределено) Экспорт 
	
	ДанныеВыбора = Новый СписокЗначений;

	Если Лев(СтрокаПоиска, 1) = "№" Тогда
		СтрокаПоиска = СокрЛП(Сред(СтрокаПоиска, 2));
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Отправитель) И Не ЗначениеЗаполнено(СтрокаПоиска)Тогда
		Возврат ДанныеВыбора;
	КонецЕсли;
		
	// Поиск по номеру или наименованию
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИсходящиеДокументы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
	|ГДЕ
	|	ИсходящиеДокументы.РегистрационныйНомер ПОДОБНО &СтрокаПоиска
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсходящиеДокументы.Ссылка
	|ИЗ
	|	Справочник.ИсходящиеДокументы КАК ИсходящиеДокументы
	|ГДЕ
	|	ИсходящиеДокументы.Заголовок ПОДОБНО &СтрокаПоиска";
	
	Запрос.Параметры.Вставить("СтрокаПоиска", СтрокаПоиска + "%");
	
	Если ЗначениеЗаполнено(Отправитель) Тогда 
		Запрос.Текст = Запрос.Текст + "
		|	И ИсходящиеДокументы.Получатели.Получатель = &Получатель";
		Запрос.Параметры.Вставить("Получатель", Отправитель);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда 

		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли;	
	
	Возврат ДанныеВыбора;
	
КонецФункции

// Возвращает значение константы "Актуализировать классификатор". 
//
// Возвращаемое значение:
//   Истина - Булево - если требуется обновить классификатор обращений граждан.
//
Функция АктуализироватьКлассификаторОбращенийГраждан() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.АктуализироватьКлассификаторОбращенийГраждан.Получить();
	
КонецФункции

#КонецОбласти
